zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_SIPI1.h
/*! @name CCR2 - SIPI Channel Control Register 2 */
/*! @{ */

#define SIPI1_CCR2_DEN_MASK                      (0x1U)
#define SIPI1_CCR2_DEN_SHIFT                     (0U)
#define SIPI1_CCR2_DEN_WIDTH                     (1U)
#define SIPI1_CCR2_DEN(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR2_DEN_SHIFT)) & SIPI1_CCR2_DEN_MASK)

#define SIPI1_CCR2_WRT_MASK                      (0x2U)
#define SIPI1_CCR2_WRT_SHIFT                     (1U)
#define SIPI1_CCR2_WRT_WIDTH                     (1U)
#define SIPI1_CCR2_WRT(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR2_WRT_SHIFT)) & SIPI1_CCR2_WRT_MASK)

#define SIPI1_CCR2_RRT_MASK                      (0x4U)
#define SIPI1_CCR2_RRT_SHIFT                     (2U)
#define SIPI1_CCR2_RRT_WIDTH                     (1U)
#define SIPI1_CCR2_RRT(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR2_RRT_SHIFT)) & SIPI1_CCR2_RRT_MASK)

#define SIPI1_CCR2_IDT_MASK                      (0x8U)
#define SIPI1_CCR2_IDT_SHIFT                     (3U)
#define SIPI1_CCR2_IDT_WIDTH                     (1U)
#define SIPI1_CCR2_IDT(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR2_IDT_SHIFT)) & SIPI1_CCR2_IDT_MASK)

#define SIPI1_CCR2_ST_MASK                       (0x10U)
#define SIPI1_CCR2_ST_SHIFT                      (4U)
#define SIPI1_CCR2_ST_WIDTH                      (1U)
#define SIPI1_CCR2_ST(x)                         (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR2_ST_SHIFT)) & SIPI1_CCR2_ST_MASK)

#define SIPI1_CCR2_CHEN_MASK                     (0x20U)
#define SIPI1_CCR2_CHEN_SHIFT                    (5U)
#define SIPI1_CCR2_CHEN_WIDTH                    (1U)
#define SIPI1_CCR2_CHEN(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR2_CHEN_SHIFT)) & SIPI1_CCR2_CHEN_MASK)

#define SIPI1_CCR2_WL_MASK                       (0xC0U)
#define SIPI1_CCR2_WL_SHIFT                      (6U)
#define SIPI1_CCR2_WL_WIDTH                      (2U)
#define SIPI1_CCR2_WL(x)                         (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR2_WL_SHIFT)) & SIPI1_CCR2_WL_MASK)

#define SIPI1_CCR2_TC_MASK                       (0x10000U)
#define SIPI1_CCR2_TC_SHIFT                      (16U)
#define SIPI1_CCR2_TC_WIDTH                      (1U)
#define SIPI1_CCR2_TC(x)                         (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR2_TC_SHIFT)) & SIPI1_CCR2_TC_MASK)
/*! @} */

/*! @name CSR2 - SIPI Channel Status Register 2 */
/*! @{ */

#define SIPI1_CSR2_CB_MASK                       (0x4U)
#define SIPI1_CSR2_CB_SHIFT                      (2U)
#define SIPI1_CSR2_CB_WIDTH                      (1U)
#define SIPI1_CSR2_CB(x)                         (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR2_CB_SHIFT)) & SIPI1_CSR2_CB_MASK)

#define SIPI1_CSR2_ACKR_MASK                     (0x8U)
#define SIPI1_CSR2_ACKR_SHIFT                    (3U)
#define SIPI1_CSR2_ACKR_WIDTH                    (1U)
#define SIPI1_CSR2_ACKR(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR2_ACKR_SHIFT)) & SIPI1_CSR2_ACKR_MASK)

#define SIPI1_CSR2_TID_MASK                      (0x70U)
#define SIPI1_CSR2_TID_SHIFT                     (4U)
#define SIPI1_CSR2_TID_WIDTH                     (3U)
#define SIPI1_CSR2_TID(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR2_TID_SHIFT)) & SIPI1_CSR2_TID_MASK)

#define SIPI1_CSR2_RAR_MASK                      (0x80U)
#define SIPI1_CSR2_RAR_SHIFT                     (7U)
#define SIPI1_CSR2_RAR_WIDTH                     (1U)
#define SIPI1_CSR2_RAR(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR2_RAR_SHIFT)) & SIPI1_CSR2_RAR_MASK)

#define SIPI1_CSR2_READ_RX_MASK                  (0x100U)
#define SIPI1_CSR2_READ_RX_SHIFT                 (8U)
#define SIPI1_CSR2_READ_RX_WIDTH                 (1U)
#define SIPI1_CSR2_READ_RX(x)                    (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR2_READ_RX_SHIFT)) & SIPI1_CSR2_READ_RX_MASK)

#define SIPI1_CSR2_WRITE_RX_MASK                 (0x200U)
#define SIPI1_CSR2_WRITE_RX_SHIFT                (9U)
#define SIPI1_CSR2_WRITE_RX_WIDTH                (1U)
#define SIPI1_CSR2_WRITE_RX(x)                   (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR2_WRITE_RX_SHIFT)) & SIPI1_CSR2_WRITE_RX_MASK)

#define SIPI1_CSR2_WRITE_STR_RX_MASK             (0x400U)
#define SIPI1_CSR2_WRITE_STR_RX_SHIFT            (10U)
#define SIPI1_CSR2_WRITE_STR_RX_WIDTH            (1U)
#define SIPI1_CSR2_WRITE_STR_RX(x)               (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR2_WRITE_STR_RX_SHIFT)) & SIPI1_CSR2_WRITE_STR_RX_MASK)
/*! @} */

/*! @name CIR2 - SIPI Channel Interrupt Register 2 */
/*! @{ */

#define SIPI1_CIR2_ACKIE_MASK                    (0x1U)
#define SIPI1_CIR2_ACKIE_SHIFT                   (0U)
#define SIPI1_CIR2_ACKIE_WIDTH                   (1U)
#define SIPI1_CIR2_ACKIE(x)                      (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR2_ACKIE_SHIFT)) & SIPI1_CIR2_ACKIE_MASK)

#define SIPI1_CIR2_TIDIE_MASK                    (0x2U)
#define SIPI1_CIR2_TIDIE_SHIFT                   (1U)
#define SIPI1_CIR2_TIDIE_WIDTH                   (1U)
#define SIPI1_CIR2_TIDIE(x)                      (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR2_TIDIE_SHIFT)) & SIPI1_CIR2_TIDIE_MASK)

#define SIPI1_CIR2_TOIE_MASK                     (0x4U)
#define SIPI1_CIR2_TOIE_SHIFT                    (2U)
#define SIPI1_CIR2_TOIE_WIDTH                    (1U)
#define SIPI1_CIR2_TOIE(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR2_TOIE_SHIFT)) & SIPI1_CIR2_TOIE_MASK)

#define SIPI1_CIR2_TCIE_MASK                     (0x8U)
#define SIPI1_CIR2_TCIE_SHIFT                    (3U)
#define SIPI1_CIR2_TCIE_WIDTH                    (1U)
#define SIPI1_CIR2_TCIE(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR2_TCIE_SHIFT)) & SIPI1_CIR2_TCIE_MASK)

#define SIPI1_CIR2_RAIE_MASK                     (0x10U)
#define SIPI1_CIR2_RAIE_SHIFT                    (4U)
#define SIPI1_CIR2_RAIE_WIDTH                    (1U)
#define SIPI1_CIR2_RAIE(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR2_RAIE_SHIFT)) & SIPI1_CIR2_RAIE_MASK)

#define SIPI1_CIR2_WAIE_MASK                     (0x20U)
#define SIPI1_CIR2_WAIE_SHIFT                    (5U)
#define SIPI1_CIR2_WAIE_WIDTH                    (1U)
#define SIPI1_CIR2_WAIE(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR2_WAIE_SHIFT)) & SIPI1_CIR2_WAIE_MASK)
/*! @} */

/*! @name CTOR2 - SIPI Channel Timeout Register 2 */
/*! @{ */

#define SIPI1_CTOR2_TOR_MASK                     (0xFFFFFFFFU)
#define SIPI1_CTOR2_TOR_SHIFT                    (0U)
#define SIPI1_CTOR2_TOR_WIDTH                    (32U)
#define SIPI1_CTOR2_TOR(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CTOR2_TOR_SHIFT)) & SIPI1_CTOR2_TOR_MASK)
/*! @} */

/*! @name CCRC2 - SIPI Channel CRC Register 2 */
/*! @{ */

#define SIPI1_CCRC2_CRCT_MASK                    (0xFFFFU)
#define SIPI1_CCRC2_CRCT_SHIFT                   (0U)
#define SIPI1_CCRC2_CRCT_WIDTH                   (16U)
#define SIPI1_CCRC2_CRCT(x)                      (((uint32_t)(((uint32_t)(x)) << SIPI1_CCRC2_CRCT_SHIFT)) & SIPI1_CCRC2_CRCT_MASK)

#define SIPI1_CCRC2_CRCI_MASK                    (0xFFFF0000U)
#define SIPI1_CCRC2_CRCI_SHIFT                   (16U)
#define SIPI1_CCRC2_CRCI_WIDTH                   (16U)
#define SIPI1_CCRC2_CRCI(x)                      (((uint32_t)(((uint32_t)(x)) << SIPI1_CCRC2_CRCI_SHIFT)) & SIPI1_CCRC2_CRCI_MASK)
/*! @} */

/*! @name CAR2 - SIPI Channel Address Register 2 */
/*! @{ */

#define SIPI1_CAR2_CAR_MASK                      (0xFFFFFFFFU)
#define SIPI1_CAR2_CAR_SHIFT                     (0U)
#define SIPI1_CAR2_CAR_WIDTH                     (32U)
#define SIPI1_CAR2_CAR(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CAR2_CAR_SHIFT)) & SIPI1_CAR2_CAR_MASK)
/*! @} */

