zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_SIPI1.h
/*! @name CDR2 - SIPI Channel Data Register 2 */
/*! @{ */

#define SIPI1_CDR2_CDR2_MASK                     (0xFFFFFFFFU)
#define SIPI1_CDR2_CDR2_SHIFT                    (0U)
#define SIPI1_CDR2_CDR2_WIDTH                    (32U)
#define SIPI1_CDR2_CDR2(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CDR2_CDR2_SHIFT)) & SIPI1_CDR2_CDR2_MASK)
/*! @} */

/*! @name CCR3 - SIPI Channel Control Register 3 */
/*! @{ */

#define SIPI1_CCR3_DEN_MASK                      (0x1U)
#define SIPI1_CCR3_DEN_SHIFT                     (0U)
#define SIPI1_CCR3_DEN_WIDTH                     (1U)
#define SIPI1_CCR3_DEN(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR3_DEN_SHIFT)) & SIPI1_CCR3_DEN_MASK)

#define SIPI1_CCR3_WRT_MASK                      (0x2U)
#define SIPI1_CCR3_WRT_SHIFT                     (1U)
#define SIPI1_CCR3_WRT_WIDTH                     (1U)
#define SIPI1_CCR3_WRT(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR3_WRT_SHIFT)) & SIPI1_CCR3_WRT_MASK)

#define SIPI1_CCR3_RRT_MASK                      (0x4U)
#define SIPI1_CCR3_RRT_SHIFT                     (2U)
#define SIPI1_CCR3_RRT_WIDTH                     (1U)
#define SIPI1_CCR3_RRT(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR3_RRT_SHIFT)) & SIPI1_CCR3_RRT_MASK)

#define SIPI1_CCR3_IDT_MASK                      (0x8U)
#define SIPI1_CCR3_IDT_SHIFT                     (3U)
#define SIPI1_CCR3_IDT_WIDTH                     (1U)
#define SIPI1_CCR3_IDT(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR3_IDT_SHIFT)) & SIPI1_CCR3_IDT_MASK)

#define SIPI1_CCR3_CHEN_MASK                     (0x20U)
#define SIPI1_CCR3_CHEN_SHIFT                    (5U)
#define SIPI1_CCR3_CHEN_WIDTH                    (1U)
#define SIPI1_CCR3_CHEN(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR3_CHEN_SHIFT)) & SIPI1_CCR3_CHEN_MASK)

#define SIPI1_CCR3_WL_MASK                       (0xC0U)
#define SIPI1_CCR3_WL_SHIFT                      (6U)
#define SIPI1_CCR3_WL_WIDTH                      (2U)
#define SIPI1_CCR3_WL(x)                         (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR3_WL_SHIFT)) & SIPI1_CCR3_WL_MASK)

#define SIPI1_CCR3_TC_MASK                       (0x10000U)
#define SIPI1_CCR3_TC_SHIFT                      (16U)
#define SIPI1_CCR3_TC_WIDTH                      (1U)
#define SIPI1_CCR3_TC(x)                         (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR3_TC_SHIFT)) & SIPI1_CCR3_TC_MASK)
/*! @} */

/*! @name CSR3 - SIPI Channel Status Register 3 */
/*! @{ */

#define SIPI1_CSR3_CB_MASK                       (0x4U)
#define SIPI1_CSR3_CB_SHIFT                      (2U)
#define SIPI1_CSR3_CB_WIDTH                      (1U)
#define SIPI1_CSR3_CB(x)                         (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR3_CB_SHIFT)) & SIPI1_CSR3_CB_MASK)

#define SIPI1_CSR3_ACKR_MASK                     (0x8U)
#define SIPI1_CSR3_ACKR_SHIFT                    (3U)
#define SIPI1_CSR3_ACKR_WIDTH                    (1U)
#define SIPI1_CSR3_ACKR(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR3_ACKR_SHIFT)) & SIPI1_CSR3_ACKR_MASK)

#define SIPI1_CSR3_TID_MASK                      (0x70U)
#define SIPI1_CSR3_TID_SHIFT                     (4U)
#define SIPI1_CSR3_TID_WIDTH                     (3U)
#define SIPI1_CSR3_TID(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR3_TID_SHIFT)) & SIPI1_CSR3_TID_MASK)

#define SIPI1_CSR3_RAR_MASK                      (0x80U)
#define SIPI1_CSR3_RAR_SHIFT                     (7U)
#define SIPI1_CSR3_RAR_WIDTH                     (1U)
#define SIPI1_CSR3_RAR(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR3_RAR_SHIFT)) & SIPI1_CSR3_RAR_MASK)

#define SIPI1_CSR3_READ_RX_MASK                  (0x100U)
#define SIPI1_CSR3_READ_RX_SHIFT                 (8U)
#define SIPI1_CSR3_READ_RX_WIDTH                 (1U)
#define SIPI1_CSR3_READ_RX(x)                    (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR3_READ_RX_SHIFT)) & SIPI1_CSR3_READ_RX_MASK)

#define SIPI1_CSR3_WRITE_RX_MASK                 (0x200U)
#define SIPI1_CSR3_WRITE_RX_SHIFT                (9U)
#define SIPI1_CSR3_WRITE_RX_WIDTH                (1U)
#define SIPI1_CSR3_WRITE_RX(x)                   (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR3_WRITE_RX_SHIFT)) & SIPI1_CSR3_WRITE_RX_MASK)
/*! @} */

/*! @name CIR3 - SIPI Channel Interrupt Register 3 */
/*! @{ */

#define SIPI1_CIR3_ACKIE_MASK                    (0x1U)
#define SIPI1_CIR3_ACKIE_SHIFT                   (0U)
#define SIPI1_CIR3_ACKIE_WIDTH                   (1U)
#define SIPI1_CIR3_ACKIE(x)                      (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR3_ACKIE_SHIFT)) & SIPI1_CIR3_ACKIE_MASK)

#define SIPI1_CIR3_TIDIE_MASK                    (0x2U)
#define SIPI1_CIR3_TIDIE_SHIFT                   (1U)
#define SIPI1_CIR3_TIDIE_WIDTH                   (1U)
#define SIPI1_CIR3_TIDIE(x)                      (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR3_TIDIE_SHIFT)) & SIPI1_CIR3_TIDIE_MASK)

#define SIPI1_CIR3_TOIE_MASK                     (0x4U)
#define SIPI1_CIR3_TOIE_SHIFT                    (2U)
#define SIPI1_CIR3_TOIE_WIDTH                    (1U)
#define SIPI1_CIR3_TOIE(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR3_TOIE_SHIFT)) & SIPI1_CIR3_TOIE_MASK)

#define SIPI1_CIR3_TCIE_MASK                     (0x8U)
#define SIPI1_CIR3_TCIE_SHIFT                    (3U)
#define SIPI1_CIR3_TCIE_WIDTH                    (1U)
#define SIPI1_CIR3_TCIE(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR3_TCIE_SHIFT)) & SIPI1_CIR3_TCIE_MASK)

#define SIPI1_CIR3_RAIE_MASK                     (0x10U)
#define SIPI1_CIR3_RAIE_SHIFT                    (4U)
#define SIPI1_CIR3_RAIE_WIDTH                    (1U)
#define SIPI1_CIR3_RAIE(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR3_RAIE_SHIFT)) & SIPI1_CIR3_RAIE_MASK)

#define SIPI1_CIR3_WAIE_MASK                     (0x20U)
#define SIPI1_CIR3_WAIE_SHIFT                    (5U)
#define SIPI1_CIR3_WAIE_WIDTH                    (1U)
#define SIPI1_CIR3_WAIE(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR3_WAIE_SHIFT)) & SIPI1_CIR3_WAIE_MASK)
/*! @} */

/*! @name CTOR3 - SIPI Channel Timeout Register 3 */
/*! @{ */

#define SIPI1_CTOR3_TOR_MASK                     (0xFFFFFFFFU)
#define SIPI1_CTOR3_TOR_SHIFT                    (0U)
#define SIPI1_CTOR3_TOR_WIDTH                    (32U)
#define SIPI1_CTOR3_TOR(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CTOR3_TOR_SHIFT)) & SIPI1_CTOR3_TOR_MASK)
/*! @} */

