zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_SIPI1.h
/*! @name CCRC3 - SIPI Channel CRC Register 3 */
/*! @{ */

#define SIPI1_CCRC3_CRCT_MASK                    (0xFFFFU)
#define SIPI1_CCRC3_CRCT_SHIFT                   (0U)
#define SIPI1_CCRC3_CRCT_WIDTH                   (16U)
#define SIPI1_CCRC3_CRCT(x)                      (((uint32_t)(((uint32_t)(x)) << SIPI1_CCRC3_CRCT_SHIFT)) & SIPI1_CCRC3_CRCT_MASK)

#define SIPI1_CCRC3_CRCI_MASK                    (0xFFFF0000U)
#define SIPI1_CCRC3_CRCI_SHIFT                   (16U)
#define SIPI1_CCRC3_CRCI_WIDTH                   (16U)
#define SIPI1_CCRC3_CRCI(x)                      (((uint32_t)(((uint32_t)(x)) << SIPI1_CCRC3_CRCI_SHIFT)) & SIPI1_CCRC3_CRCI_MASK)
/*! @} */

/*! @name CAR3 - SIPI Channel Address Register 3 */
/*! @{ */

#define SIPI1_CAR3_CAR_MASK                      (0xFFFFFFFFU)
#define SIPI1_CAR3_CAR_SHIFT                     (0U)
#define SIPI1_CAR3_CAR_WIDTH                     (32U)
#define SIPI1_CAR3_CAR(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CAR3_CAR_SHIFT)) & SIPI1_CAR3_CAR_MASK)
/*! @} */

/*! @name CDR3 - SIPI Channel Data Register 3 */
/*! @{ */

#define SIPI1_CDR3_CDR_MASK                      (0xFFFFFFFFU)
#define SIPI1_CDR3_CDR_SHIFT                     (0U)
#define SIPI1_CDR3_CDR_WIDTH                     (32U)
#define SIPI1_CDR3_CDR(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CDR3_CDR_SHIFT)) & SIPI1_CDR3_CDR_MASK)
/*! @} */

/*! @name MCR - SIPI Module Configuration Register */
/*! @{ */

#define SIPI1_MCR_SR_MASK                        (0x1U)
#define SIPI1_MCR_SR_SHIFT                       (0U)
#define SIPI1_MCR_SR_WIDTH                       (1U)
#define SIPI1_MCR_SR(x)                          (((uint32_t)(((uint32_t)(x)) << SIPI1_MCR_SR_SHIFT)) & SIPI1_MCR_SR_MASK)

#define SIPI1_MCR_MOEN_MASK                      (0x2U)
#define SIPI1_MCR_MOEN_SHIFT                     (1U)
#define SIPI1_MCR_MOEN_WIDTH                     (1U)
#define SIPI1_MCR_MOEN(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_MCR_MOEN_SHIFT)) & SIPI1_MCR_MOEN_MASK)

#define SIPI1_MCR_INIT_MASK                      (0x4U)
#define SIPI1_MCR_INIT_SHIFT                     (2U)
#define SIPI1_MCR_INIT_WIDTH                     (1U)
#define SIPI1_MCR_INIT(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_MCR_INIT_SHIFT)) & SIPI1_MCR_INIT_MASK)

#define SIPI1_MCR_TEN_MASK                       (0x8U)
#define SIPI1_MCR_TEN_SHIFT                      (3U)
#define SIPI1_MCR_TEN_WIDTH                      (1U)
#define SIPI1_MCR_TEN(x)                         (((uint32_t)(((uint32_t)(x)) << SIPI1_MCR_TEN_SHIFT)) & SIPI1_MCR_TEN_MASK)

#define SIPI1_MCR_CHNSB_MASK                     (0x10U)
#define SIPI1_MCR_CHNSB_SHIFT                    (4U)
#define SIPI1_MCR_CHNSB_WIDTH                    (1U)
#define SIPI1_MCR_CHNSB(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_MCR_CHNSB_SHIFT)) & SIPI1_MCR_CHNSB_MASK)

#define SIPI1_MCR_LEGACY_MODE_BIT_MASK           (0x20U)
#define SIPI1_MCR_LEGACY_MODE_BIT_SHIFT          (5U)
#define SIPI1_MCR_LEGACY_MODE_BIT_WIDTH          (1U)
#define SIPI1_MCR_LEGACY_MODE_BIT(x)             (((uint32_t)(((uint32_t)(x)) << SIPI1_MCR_LEGACY_MODE_BIT_SHIFT)) & SIPI1_MCR_LEGACY_MODE_BIT_MASK)

#define SIPI1_MCR_MCRIE_MASK                     (0x200U)
#define SIPI1_MCR_MCRIE_SHIFT                    (9U)
#define SIPI1_MCR_MCRIE_WIDTH                    (1U)
#define SIPI1_MCR_MCRIE(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_MCR_MCRIE_SHIFT)) & SIPI1_MCR_MCRIE_MASK)

#define SIPI1_MCR_CRCIE_MASK                     (0x400U)
#define SIPI1_MCR_CRCIE_SHIFT                    (10U)
#define SIPI1_MCR_CRCIE_WIDTH                    (1U)
#define SIPI1_MCR_CRCIE(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_MCR_CRCIE_SHIFT)) & SIPI1_MCR_CRCIE_MASK)

#define SIPI1_MCR_AID_MASK                       (0xC000U)
#define SIPI1_MCR_AID_SHIFT                      (14U)
#define SIPI1_MCR_AID_WIDTH                      (2U)
#define SIPI1_MCR_AID(x)                         (((uint32_t)(((uint32_t)(x)) << SIPI1_MCR_AID_SHIFT)) & SIPI1_MCR_AID_MASK)

#define SIPI1_MCR_PRSCLR_MASK                    (0x7FF0000U)
#define SIPI1_MCR_PRSCLR_SHIFT                   (16U)
#define SIPI1_MCR_PRSCLR_WIDTH                   (11U)
#define SIPI1_MCR_PRSCLR(x)                      (((uint32_t)(((uint32_t)(x)) << SIPI1_MCR_PRSCLR_SHIFT)) & SIPI1_MCR_PRSCLR_MASK)

#define SIPI1_MCR_HALT_MASK                      (0x20000000U)
#define SIPI1_MCR_HALT_SHIFT                     (29U)
#define SIPI1_MCR_HALT_WIDTH                     (1U)
#define SIPI1_MCR_HALT(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_MCR_HALT_SHIFT)) & SIPI1_MCR_HALT_MASK)

#define SIPI1_MCR_FRZ_MASK                       (0x80000000U)
#define SIPI1_MCR_FRZ_SHIFT                      (31U)
#define SIPI1_MCR_FRZ_WIDTH                      (1U)
#define SIPI1_MCR_FRZ(x)                         (((uint32_t)(((uint32_t)(x)) << SIPI1_MCR_FRZ_SHIFT)) & SIPI1_MCR_FRZ_MASK)
/*! @} */

/*! @name SR - SIPI Status Register */
/*! @{ */

#define SIPI1_SR_STATE_MASK                      (0xFU)
#define SIPI1_SR_STATE_SHIFT                     (0U)
#define SIPI1_SR_STATE_WIDTH                     (4U)
#define SIPI1_SR_STATE(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_SR_STATE_SHIFT)) & SIPI1_SR_STATE_MASK)

#define SIPI1_SR_TE_MASK                         (0xF0U)
#define SIPI1_SR_TE_SHIFT                        (4U)
#define SIPI1_SR_TE_WIDTH                        (4U)
#define SIPI1_SR_TE(x)                           (((uint32_t)(((uint32_t)(x)) << SIPI1_SR_TE_SHIFT)) & SIPI1_SR_TE_MASK)

#define SIPI1_SR_FRAME_TX_MASK                   (0x100U)
#define SIPI1_SR_FRAME_TX_SHIFT                  (8U)
#define SIPI1_SR_FRAME_TX_WIDTH                  (1U)
#define SIPI1_SR_FRAME_TX(x)                     (((uint32_t)(((uint32_t)(x)) << SIPI1_SR_FRAME_TX_SHIFT)) & SIPI1_SR_FRAME_TX_MASK)

#define SIPI1_SR_MCR_MASK                        (0x200U)
#define SIPI1_SR_MCR_SHIFT                       (9U)
#define SIPI1_SR_MCR_WIDTH                       (1U)
#define SIPI1_SR_MCR(x)                          (((uint32_t)(((uint32_t)(x)) << SIPI1_SR_MCR_SHIFT)) & SIPI1_SR_MCR_MASK)

#define SIPI1_SR_GCRCE_MASK                      (0x400U)
#define SIPI1_SR_GCRCE_SHIFT                     (10U)
#define SIPI1_SR_GCRCE_WIDTH                     (1U)
#define SIPI1_SR_GCRCE(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_SR_GCRCE_SHIFT)) & SIPI1_SR_GCRCE_MASK)

#define SIPI1_SR_ACK_TX_MASK                     (0x800U)
#define SIPI1_SR_ACK_TX_SHIFT                    (11U)
#define SIPI1_SR_ACK_TX_WIDTH                    (1U)
#define SIPI1_SR_ACK_TX(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_SR_ACK_TX_SHIFT)) & SIPI1_SR_ACK_TX_MASK)

