zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_SIPI1.h
#define SIPI1_SR_READ_OK_TX_MASK                 (0x1000U)
#define SIPI1_SR_READ_OK_TX_SHIFT                (12U)
#define SIPI1_SR_READ_OK_TX_WIDTH                (1U)
#define SIPI1_SR_READ_OK_TX(x)                   (((uint32_t)(((uint32_t)(x)) << SIPI1_SR_READ_OK_TX_SHIFT)) & SIPI1_SR_READ_OK_TX_MASK)

#define SIPI1_SR_INVALID_FRAME_RX_MASK           (0x2000U)
#define SIPI1_SR_INVALID_FRAME_RX_SHIFT          (13U)
#define SIPI1_SR_INVALID_FRAME_RX_WIDTH          (1U)
#define SIPI1_SR_INVALID_FRAME_RX(x)             (((uint32_t)(((uint32_t)(x)) << SIPI1_SR_INVALID_FRAME_RX_SHIFT)) & SIPI1_SR_INVALID_FRAME_RX_MASK)

#define SIPI1_SR_LPMACK_MASK                     (0x40000000U)
#define SIPI1_SR_LPMACK_SHIFT                    (30U)
#define SIPI1_SR_LPMACK_WIDTH                    (1U)
#define SIPI1_SR_LPMACK(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_SR_LPMACK_SHIFT)) & SIPI1_SR_LPMACK_MASK)

#define SIPI1_SR_FRZACK_MASK                     (0x80000000U)
#define SIPI1_SR_FRZACK_SHIFT                    (31U)
#define SIPI1_SR_FRZACK_WIDTH                    (1U)
#define SIPI1_SR_FRZACK(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_SR_FRZACK_SHIFT)) & SIPI1_SR_FRZACK_MASK)
/*! @} */

/*! @name MAXCR - SIPI Max Count Register */
/*! @{ */

#define SIPI1_MAXCR_MXCNT_MASK                   (0xFFFFFFFCU)
#define SIPI1_MAXCR_MXCNT_SHIFT                  (2U)
#define SIPI1_MAXCR_MXCNT_WIDTH                  (30U)
#define SIPI1_MAXCR_MXCNT(x)                     (((uint32_t)(((uint32_t)(x)) << SIPI1_MAXCR_MXCNT_SHIFT)) & SIPI1_MAXCR_MXCNT_MASK)
/*! @} */

/*! @name ARR - SIPI Address Reload Register */
/*! @{ */

#define SIPI1_ARR_ADRLD_MASK                     (0xFFFFFFFCU)
#define SIPI1_ARR_ADRLD_SHIFT                    (2U)
#define SIPI1_ARR_ADRLD_WIDTH                    (30U)
#define SIPI1_ARR_ADRLD(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_ARR_ADRLD_SHIFT)) & SIPI1_ARR_ADRLD_MASK)
/*! @} */

/*! @name ACR - SIPI Address Count Register */
/*! @{ */

#define SIPI1_ACR_ADCNT_MASK                     (0xFFFFFFFCU)
#define SIPI1_ACR_ADCNT_SHIFT                    (2U)
#define SIPI1_ACR_ADCNT_WIDTH                    (30U)
#define SIPI1_ACR_ADCNT(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_ACR_ADCNT_SHIFT)) & SIPI1_ACR_ADCNT_MASK)
/*! @} */

/*! @name ERR - SIPI Error Register */
/*! @{ */

#define SIPI1_ERR_ACKE0_MASK                     (0x1U)
#define SIPI1_ERR_ACKE0_SHIFT                    (0U)
#define SIPI1_ERR_ACKE0_WIDTH                    (1U)
#define SIPI1_ERR_ACKE0(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_ERR_ACKE0_SHIFT)) & SIPI1_ERR_ACKE0_MASK)

#define SIPI1_ERR_TIDE0_MASK                     (0x2U)
#define SIPI1_ERR_TIDE0_SHIFT                    (1U)
#define SIPI1_ERR_TIDE0_WIDTH                    (1U)
#define SIPI1_ERR_TIDE0(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_ERR_TIDE0_SHIFT)) & SIPI1_ERR_TIDE0_MASK)

#define SIPI1_ERR_TOE0_MASK                      (0x4U)
#define SIPI1_ERR_TOE0_SHIFT                     (2U)
#define SIPI1_ERR_TOE0_WIDTH                     (1U)
#define SIPI1_ERR_TOE0(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_ERR_TOE0_SHIFT)) & SIPI1_ERR_TOE0_MASK)

#define SIPI1_ERR_ACKE1_MASK                     (0x100U)
#define SIPI1_ERR_ACKE1_SHIFT                    (8U)
#define SIPI1_ERR_ACKE1_WIDTH                    (1U)
#define SIPI1_ERR_ACKE1(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_ERR_ACKE1_SHIFT)) & SIPI1_ERR_ACKE1_MASK)

#define SIPI1_ERR_TIDE1_MASK                     (0x200U)
#define SIPI1_ERR_TIDE1_SHIFT                    (9U)
#define SIPI1_ERR_TIDE1_WIDTH                    (1U)
#define SIPI1_ERR_TIDE1(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_ERR_TIDE1_SHIFT)) & SIPI1_ERR_TIDE1_MASK)

#define SIPI1_ERR_TOE1_MASK                      (0x400U)
#define SIPI1_ERR_TOE1_SHIFT                     (10U)
#define SIPI1_ERR_TOE1_WIDTH                     (1U)
#define SIPI1_ERR_TOE1(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_ERR_TOE1_SHIFT)) & SIPI1_ERR_TOE1_MASK)

#define SIPI1_ERR_ACKE2_MASK                     (0x10000U)
#define SIPI1_ERR_ACKE2_SHIFT                    (16U)
#define SIPI1_ERR_ACKE2_WIDTH                    (1U)
#define SIPI1_ERR_ACKE2(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_ERR_ACKE2_SHIFT)) & SIPI1_ERR_ACKE2_MASK)

#define SIPI1_ERR_TIDE2_MASK                     (0x20000U)
#define SIPI1_ERR_TIDE2_SHIFT                    (17U)
#define SIPI1_ERR_TIDE2_WIDTH                    (1U)
#define SIPI1_ERR_TIDE2(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_ERR_TIDE2_SHIFT)) & SIPI1_ERR_TIDE2_MASK)

#define SIPI1_ERR_TOE2_MASK                      (0x40000U)
#define SIPI1_ERR_TOE2_SHIFT                     (18U)
#define SIPI1_ERR_TOE2_WIDTH                     (1U)
#define SIPI1_ERR_TOE2(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_ERR_TOE2_SHIFT)) & SIPI1_ERR_TOE2_MASK)

#define SIPI1_ERR_ACKE3_MASK                     (0x1000000U)
#define SIPI1_ERR_ACKE3_SHIFT                    (24U)
#define SIPI1_ERR_ACKE3_WIDTH                    (1U)
#define SIPI1_ERR_ACKE3(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_ERR_ACKE3_SHIFT)) & SIPI1_ERR_ACKE3_MASK)

#define SIPI1_ERR_TIDE3_MASK                     (0x2000000U)
#define SIPI1_ERR_TIDE3_SHIFT                    (25U)
#define SIPI1_ERR_TIDE3_WIDTH                    (1U)
#define SIPI1_ERR_TIDE3(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_ERR_TIDE3_SHIFT)) & SIPI1_ERR_TIDE3_MASK)

#define SIPI1_ERR_TOE3_MASK                      (0x4000000U)
#define SIPI1_ERR_TOE3_SHIFT                     (26U)
#define SIPI1_ERR_TOE3_WIDTH                     (1U)
#define SIPI1_ERR_TOE3(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_ERR_TOE3_SHIFT)) & SIPI1_ERR_TOE3_MASK)
/*! @} */

/*! @name DEBUG - SIPI Debug Register */
/*! @{ */

#define SIPI1_DEBUG_STATE_MASK                   (0xFFFFU)
#define SIPI1_DEBUG_STATE_SHIFT                  (0U)
#define SIPI1_DEBUG_STATE_WIDTH                  (16U)
#define SIPI1_DEBUG_STATE(x)                     (((uint32_t)(((uint32_t)(x)) << SIPI1_DEBUG_STATE_SHIFT)) & SIPI1_DEBUG_STATE_MASK)

#define SIPI1_DEBUG_OUTSTANDING_MASK             (0xF0000U)
#define SIPI1_DEBUG_OUTSTANDING_SHIFT            (16U)
#define SIPI1_DEBUG_OUTSTANDING_WIDTH            (4U)
#define SIPI1_DEBUG_OUTSTANDING(x)               (((uint32_t)(((uint32_t)(x)) << SIPI1_DEBUG_OUTSTANDING_SHIFT)) & SIPI1_DEBUG_OUTSTANDING_MASK)
/*! @} */

/*! @name PMR - SIPI Performance Monitor register */
/*! @{ */

#define SIPI1_PMR_BIN0_MASK                      (0xFFU)
#define SIPI1_PMR_BIN0_SHIFT                     (0U)
#define SIPI1_PMR_BIN0_WIDTH                     (8U)
#define SIPI1_PMR_BIN0(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_PMR_BIN0_SHIFT)) & SIPI1_PMR_BIN0_MASK)

#define SIPI1_PMR_BIN1_MASK                      (0xFF00U)
#define SIPI1_PMR_BIN1_SHIFT                     (8U)
#define SIPI1_PMR_BIN1_WIDTH                     (8U)
#define SIPI1_PMR_BIN1(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_PMR_BIN1_SHIFT)) & SIPI1_PMR_BIN1_MASK)

#define SIPI1_PMR_BIN2_MASK                      (0xFF0000U)
#define SIPI1_PMR_BIN2_SHIFT                     (16U)
#define SIPI1_PMR_BIN2_WIDTH                     (8U)
#define SIPI1_PMR_BIN2(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_PMR_BIN2_SHIFT)) & SIPI1_PMR_BIN2_MASK)

#define SIPI1_PMR_BIN3_MASK                      (0xFF000000U)
#define SIPI1_PMR_BIN3_SHIFT                     (24U)
#define SIPI1_PMR_BIN3_WIDTH                     (8U)
#define SIPI1_PMR_BIN3(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_PMR_BIN3_SHIFT)) & SIPI1_PMR_BIN3_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group SIPI1_Register_Masks */

/*!
 * @}
 */ /* end of group SIPI1_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K39_SIPI1_H_) */
